finger563/esp-usb-audio-example/sdkconfig.defaults
# Since this example uses USB (specifically TinyUSB), we can only target ESP32s2
#  or ESP32s3. We are designed for the ESP32-S3-BOX, so we use the S3
# CONFIG_IDF_TARGET="esp32s2"
CONFIG_IDF_TARGET="esp32s3"

# freertos should run at 1 khz instead of the default 100 hz
CONFIG_FREERTOS_HZ=1000

# run the esp at max clock speed (240 mhz)
# ESP32-specific
#
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# Common ESP-related
#
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
